{
    "attribs": [],
    "characters": [],
    "events": [],
    "items": [],
    "locations": [
        {
            "description": "• The problem is clear, but you'll need to decide how to <c=\"green\">solve it</c>.\r\n• Chop down trees to build a raft, or swim across (might want to practice first), or build a bridge, or look for vines.\r\n• Alternatively, play an <c=\"green\">escape room</c>.\r\n\r\nShouldn't last indefinitely, as many scenarios could.",
            "destinations": [],
            "dimensions": [0,0],
            "excluded": [0,0,0,0],
            "id": 3,
            "items": [],
            "masked": false,
            "name": "River Crossing",
            "progress": {},
            "quantity": 0.0,
            "toplevel": true
        },
        {
            "description": "Attempt to take over the world, or at least a significant part of it. Could also be in outer space.\r\n\r\nDevelop <c=\"green\">technology</c> and build resources along the way.\r\n\r\nThis could be simple like <i>Risk</i>, or complex like <i>Civilization</i>.",
            "destinations": [],
            "dimensions": [0,0],
            "excluded": [0,0,0,0],
            "id": 4,
            "items": [],
            "masked": false,
            "name": "Empire",
            "progress": {},
            "quantity": 0.0,
            "toplevel": true
        },
        {
            "description": "• Various forms of <c=\"green\">transportation</c> for part of the trip: train, bus, taxi, plane, boat, wagon.\r\n• Buy food as well as tickets, with a limited supply of <c=\"green\">money</c>.\r\n• Consider a foreign country, with some descriptions in other <c=\"green\">languages</c>. Include English translations if you plan on sharing the scenario with a wider audience.\r\n• Keep your party safe and healthy through setbacks and challenges.\r\n• The goal could be reaching new territory to settle, winning a bet, or arriving at a vacation spot.\r\n\r\nClassic examples are <i>Oregon Trail</i> and <i>Around the World in 80 Days</i>.",
            "destinations": [],
            "dimensions": [0,0],
            "excluded": [0,0,0,0],
            "id": 1,
            "items": [],
            "masked": false,
            "name": "Journey",
            "progress": {},
            "quantity": 0.0,
            "toplevel": true
        },
        {
            "description": "• Play at <c=\"green\">politics</c> to get elected. Try an inspiring slogan to gain popularity, such as, <i>Change for a brighter future!</i>\r\n• Persuade congress to pass important laws that the people care about, such as, <i>More Dogs and Fewer Cats.</i>\r\n• Build a <c=\"green\">bigger city</c>, with transportation, schools, hospitals, and fire departments.\r\n\r\n<i>SimCity</i> is a good example of city-building, though it doesn't go much into diplomacy.",
            "destinations": [],
            "dimensions": [0,0],
            "excluded": [0,0,0,0],
            "id": 5,
            "items": [],
            "masked": false,
            "name": "Mayor",
            "progress": {},
            "quantity": 0.0,
            "toplevel": true
        },
        {
            "description": "Grow, train, and play with an animal or fantasy creature.\r\n\r\n• Track <c=\"green\">skills and needs</c> with general items.\r\n• There is a child responsible for taking care of and enjoying it.",
            "destinations": [],
            "dimensions": [0,0],
            "excluded": [0,0,0,0],
            "id": 7,
            "items": [],
            "masked": false,
            "name": "Pet",
            "progress": {},
            "quantity": 0.0,
            "toplevel": true
        }
    ],
    "overall": {
        "description": "A list to look through and take inspiration from. Begin with a <a href=\"/configure\">blank setup</a> and copy the title and description of your choice into <i>Overall Settings</i>.",
        "progress_type": "Various",
        "multiplayer": true,
        "number_format": "en_US",
        "slots": [],
        "title": "Unformed Ideas",
        "win_reqs": []
    }
}
